Tekla.Structures.Model.InputItem
The InputItem class is used to store input objects and positions.

Tekla.Structures.Model.InputItem.GetInputType
Returns the type of the input item.
Returns: The type of the input item.

Tekla.Structures.Model.InputItem.GetData
Returns the data of the input item.
See also: Tekla.Structures.Model.InputItem.InputTypeEnum.
Returns: The input data.